<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN">
<html><head>


<meta http-equiv="content-type" content="text/html; charset=iso-8859-1"><title>Erstellen eines Fotomosaiks</title>
<link rel="stylesheet" type="text/css" href="style.css"></head><body>
<h1>4. Erstellen eines Fotomosaiks</h1>
<p>Wenn Sie bereits eine Bilderdatenbank erstellt haben, k&ouml;nnen Sie damit nun ein Fotomosaik erzeugen.</p>
<br><p>Klicken Sie dazu auf die "Neues Mosaik"-Scaltfl&auml;che im Hauptfenster.</p>
<div align="left"><img src="pics/mainwin.png" height="581" width="686"></div>

<br><p>Im
folgenden Dialog m&uuml;ssen Sie die grundlegenden Einstellungen
f&uuml;r das neue Mosaik treffen. W&auml;hlen Sie im "Datenbank"-Feld
die Datenbank mit den Bildern f&uuml;r das Mosaik aus. Im
"Ursprungsbild"-Feld m&uuml;ssen Sie das in ein Mosaik umzuwandelnde
Bild angeben. Geben Sie in dem untersten Feld den Dateinamen, unter dem
das neu erstellte Mosaik gespeichert werden soll, an. Bet&auml;tigen
Sie zum Abschluss die "Weiter"-Schaltfl&auml;che.</p>
<div align="left"><img src="pics/createmosaic.png" height="258" width="660"></div>

<br><p>Jetzt k&ouml;nnen Sie die detaillierten Einstellungen f&uuml;r das neue Mosaik festlegen.
      <br>
Zuerst die Gr&ouml;&szlig;e der einzelnen Kacheln. Das Mosaik wird aus
vielen kleinen Kacheln zusammengesetzt, jede mit der hier festgelegten
Gr&ouml;&szlig;e. Wenn Sie beabsichtigen, das Mosaik zu drucken,
sollten Sie f&uuml;r die l&auml;ngere Seite einer Kachel mindestens 1
cm L&auml;nge einplanen. W&auml;hlen Sie die Kachelgr&ouml;&szlig;e
dann entsprechend der gew&uuml;nschten Aufl&ouml;sung. Werte im Bereich
von 100-150 Pixel sind ein guter Startwert.
<br>
Darunter k&ouml;nnen Sie das Seitenverh&auml;ltnis der Kacheln
festlegen; W&auml;hlen Sie das Seitenverh&auml;ltnis, das dem der
meisten Bilder in der Datenbank entspricht. Sollten diese
unterschiedliche Seitenverh&auml;ltnisse haben (einige hochkant und
einige querkant), so ist 1:1 eine gute Wahl.
</p>
<div align="left"><img src="pics/mosaicdetails.png" height="391" width="656"></div>
<p>		
<br>Die n&auml;chste Option beschreibt, wie die Kacheln, deren
Gr&ouml;&szlig;enverh&auml;ltnis nicht dem oben festgelegten
entspricht, angepasst werden; Sie k&ouml;nnen entweder die R&auml;nder
beschneiden oder das Bild skalieren. Beachten Sie, dass wenn ein
gro&szlig;er Unterschied zwischen dem urspr&uuml;nglichen und dem von
Ihnen gew&auml;hlten Seitenverh&auml;ltnis liegt, durch das Beschneiden
der R&auml;nder m&ouml;glicherweise wichtige Details abgeschnitten
werden k&ouml;nnten. Andererseits werden die Kacheln in diesem Fall
durch das Skalieren verzerrt erscheinen. Deshalb werden Sie die besten
Ergebnisse erreichen, wenn Sie Bilder w&auml;hlen, bei denen sich keine
wichtigen Details am Rand befinden (etwa Landschaften) oder wenn alle
Bilder in der Datenbank ein &auml;hnliches Seitenverh&auml;ltnis haben.
Ich empfehle hier, die R&auml;nder zu beschneiden.
<br>Legen Sie dann die Anzahl der Kacheln in dem Mosaik insgesamt
fest; Je h&ouml;her Sie diesen Wert w&auml;hlen, desto besser und
beeindruckender wird das Ergebnis, aber auch die ben&ouml;tigte Zeit
und der ben&ouml;tigte Speicher zum Rendern sein. Beachten Sie auch,
dass falls Sie das Mosaik etwa als Poster drucken m&ouml;chten, Sie
eine tats&auml;chliche L&auml;nge von mindestens 1 cm f&uuml;r die
l&auml;ngere Kachelseite w&auml;hlen sollten. Sollten Sie also ein
Mosaik mit 4800 Kacheln erstellen und das Ursprungsbild ein
Seitenverh&auml;ltnis von 4:3 haben mit einem Seitenverh&auml;ltnis der
Kacheln von 1:1, dann wird das Mosaik aus 80x60 Kacheln erstellt
werden. Also m&uuml;ssten Sie ein Poster mit einer Gr&ouml;&szlig;e von
mindestens 80x60 cm drucken, um sicherzustellen, dass die einzelnen
Kacheln noch erkennbar sind. Ich empfehle, hier einen Wert zwischen
2000 und 10000 zu w&auml;hlen.
<br>Die Option "Minimaler Abstand zwischen den selben Kacheln"
l&auml;sst Sie festlegen, wieviel Mindestabstand zwischen zwei
Vorkommen derselben Kachel liegen muss. Beachten Sie, dass ein zu hoher
Wert bei einer zu kleinen Datenbank die Bildqualit&auml;t mindern oder
sogar das Erstellen des Mosaiks unm&ouml;glich machen wird, wenn keine
passende Kachel mehr gefunden werden kann. Ich empfehle, hier einen
Wert aus dem Bereich von 4-10 zu w&auml;hlen, abh&auml;ngig von dem
Ursprungsbild und der gew&auml;hlten Datenbank.
<br>Jetzt k&ouml;nnen Sie festlegen, wie oft eine Kachel maximal in
einem Mosaik auftauchen darf. Beachten Sie, dass ein zu niedriger Wert
die Bildqualit&auml;t mindern oder sogar das Erstellen des Mosaiks
unm&ouml;glich machen wird, wenn keine passende Kachel gefunden werden
kann. Ich empfehle, diese Option nicht zu verwenden und stattdessen
einen Mindestabstand zwischen dem Auftauchen der selben Kachel
festzulegen.
<br>Sie k&ouml;nnen auch einen Alphawert festlegen, mit dem das
Ursprungsbild &uuml;ber das Mosaik gelegt wird. Dies wird die Farbe der
Kacheln beeinflussen und ein besseres Ergebnis bringen, wenn die Bilder
in Ihrer Datenbank nicht optimal sind. W&auml;hlen Sie einen Wert von
"0", um diese Option zu deaktivieren; "1" bedeutet maximale
Transparenz, "99" minimale Transparenz. Ich empfehle einen Wert aus dem
Bereich von 30-33.
<br>Abschlie&szlig;end wird die Gr&ouml;&szlig;e des Mosaiks
angezeigt. Dies kann einen Hinweis darauf geben, wieviel Speicher und
Zeit zum Rendern des Mosaiks ben&ouml;tigt werden wird. Ein Mosaik mit
60 Megapixeln und Alpha blending mit dem Ursprungsbild wird etwa 300MB
Arbeitsspeicher ben&ouml;tigen und auf einem etwas &auml;lteren AMD
Athlon XP mobile 2600+ etwa 10-15 Minuten dauern.
<br>Wenn Sie alle Einstellungen getroffen haben, w&auml;hlen Sie die "Rendern"-Schaltfl&auml;che.
</p>

<br><p>Haben Sie nun etwas Geduld, w&auml;hrend das Mosaik erstellt
wird. Abh&auml;ngig von den gew&auml;hlten Einstellungen und der
Geschwindigkeit Ihres Rechners, wird das Rendern einige Zeit in
Anspruch nehmen.</p>
<div align="left"><img src="pics/rendermos.png" height="310" width="428"></div>

<br><p>Wenn Sie einen Dialog &auml;hnlich dem folgenden
sehen, wurde das Mosaik erfolgreich erstellt! Sollte das Erstellen
fehlschlagen, finden Sie weitere Informationen unter <a href="chapter5.html#5.1">"5.1 Das Rendern des Mosaiks schl&auml;gt fehl"</a>.</p>
<div align="left"><img src="pics/rendermoscompl.png" height="310" width="428"></div>

<br><p>Sie finden das fertige Mosaik nun unter dem gew&auml;hlten Dateinamen.</p>
<div align="left"><img src="pics/browseresults.png" height="600" width="800"></div>
</body></html>