<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN">
<html><head>

  
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1"><title>Bilderdatenbanken</title>
  

  
  
  <link rel="stylesheet" type="text/css" href="style.css"></head><body>
<h1>3. Bilderdatenbanken</h1>

<h2><a name="3.1">3.1 Erstellen einer Bilderdatenbank</a></h2>
<p>Vor dem Erstellen eines Fotomosaiks ist es notwendig, eine
Bilderdatenbank zu erstellen, die die Bilder enth&auml;lt, aus denen
das Mosaik bestehen wird.</p>

<br><p>Klicken Sie dazu auf die "Datenbank erstellen"-Schaltfl&auml;che im Hauptfenster.</p>
<div align="left"><img src="pics/mainwin.png" height="581" width="686"></div>

<br>
<div aling="left"><img src="pics/builddb.png" height="176" width="612"></div>
<p>Im obigen Dialog m&uuml;ssen Sie einen Dateinamen f&uuml;r die neue Datenbank angeben.
<br>W&auml;hlen Sie auch ein Verzeichnis, das die Dateien enth&auml;lt,
aus denen das Mosaik sp&auml;ter bestehen soll. Beachten Sie, dass das
Ergebnis je besser sein wird, desto mehr Bilder in der Datenbank sind.
Das Hinzufgen weiterer Verzeichnisse und Dateien ist nach dem Erstellen
im "Datenbank bearbeiten"-Dialog m&ouml;glich. Um gute Ergebnisse zu
erzielen, sollten sich mehrere Tausend Bilder mit verschiedenen Motiven
und Grundfarben in der Datenbank befinden. Es ist auch von Vorteil,
wenn alle Bilder das selbe oder ein &auml;hnliches
Seitenverh&auml;ltnis aufweisen. F&uuml;r die besten Ergebnisse sollte
die Farbverteilung gleichm&auml;&szlig;ig und der Kontrast und die
Dynamik der Bilder gering sein. Sie werden aber auch mit Bildern, die
diese Kriterien nicht erf&uuml;llen, zu guten Ergebnissen gelangen -
zur Not k&ouml;nnen Sie das durch Erh&ouml;hen der Anzahl der Kacheln
im Mosaik ausgleichen.
Wollen Sie auch die Bilder in den Unterverzeichnissen des
gew&auml;hlten Ordners hinzuf&uuml;gen, w&auml;hlen Sie die
entsprechende Option. Best&auml;tigen Sie Ihre Einstellungen durch
bet&auml;tigen der "Datenbank erstellen"-Schaltfl&auml;che, um die
Dateien im gew&auml;hlten Verzeichnis zu analysieren und danach die
Datenbankdatei zu speichern.</p>

<br>      <p>Haben
Sie nun etwas Geduld, w&auml;hrend die Datenbank erstellt wird.
Abh&auml;ngig von der Anzahl der Bilder im gew&auml;hlten Verzeichnis
und der Geschwindigkeit Ihres Rechners k&ouml;nnte dies eine Weile
dauern. Zuerst werden die Datein im gew&auml;hlten Verzeichnis
indiziert und zur Datenbank hinzugef&uuml;gt - danach werden Sie
analysiert, um die Durchschnittsfarbe zu ermitteln. <br>
Wenn Sie den Prozess w&auml;hrend des Indizierens abbrechen, wird keine
Datenbank gespeichert werden. Wenn Sie die Analyse der Dateien
abbrechen, wird die Datenbank gespeichert werden, zum Erstellen eines
Mosaiks werden aber nur die bereits analysierten Dateien verwendet
werden k&ouml;nnen. Sie k&ouml;nnen die ausstehenden Dateien jedoch
sp&auml;ter im "Datenbank bearbeiten"-Dialog analysieren lassen.</p>
<div align="left"><img src="pics/builddbprog.png" height="270" width="386"></div>

<br><p>Wenn Sie einen Dialog
&auml;hnlich dem folgenden sehen, ist die Datenbank nun
bereit zur Benutzung und wurde erfolgreich gespeichert. Sie k&ouml;nnen
nun Fotomosaiks damit erstellen or sie bearbeiten (Eintr&auml;ge
hinzuf&uuml;gen und entfernen) - siehe den folgenden Abschnitt.</p>
<div align="left"><img src="pics/builddbcompl.png" height="270" width="386"></div>

<h2><a name="3.2">3.2 Bearbeiten einer Bilderdatenbank</a></h2>
<p>M&ouml;chten Sie Bilder aus einer bestehenden Datenbank entfernen
oder zu dieser hinzuf&uuml;gen oder sollten Probleme mit der Datenbank
auftreten (etwa wenn Sie Dateien nach dem Hinzuf&uuml;gen zur Datenbank
gel&ouml;scht haben), w&auml;hlen Sie im Hauptfenster "Datenbank
bearbeiten".
<br>W&auml;hlen Sie nun die zu bearbeitende Datenbank aus.</p>
<br><p>Fall die Datenbank
Dateien enth&auml;lt, die noch nicht analysiert wurden, die seit der
Analyse ver&auml;ndert wurden oder die unter dem angegebenen Pfad nicht
zu finden sind, werden Sie den folgenden Dialog sehen. Wenn Sie mit "Ja"
antworten, werden alle Dateien analysiert und die nicht gefunden
markiert (pr&uuml;fen Sie auch, ob diese sich auf einem nicht
verbundenen Wechseldatentr&auml;ger befinden!). Sie k&ouml;nnen dies
auch sp&auml;ter im "Datenbank bearbeiten"-Dialog nachholen. Beachten
Sie, dass dies ein Muss ist, falls sich in der Datenbank Eintr&auml;ge
zu Dateien befinden, die Sie in der Zwischenzeit gel&ouml;scht haben.
Ansonsten wird das Erstellen eines Mosaiks mit dieser Datenbank
fehlschlagen.
</p>
<div align="left"><img src="pics/dbincompl.png" height="137" width="506"></div>

<br><div align="left"><img src="pics/editdb.png" height="449" width="679"></div>
<p>Dieser Dialog erlaubt Ihnen, die Datenbank zu bearbeiten.
<br>Oben wird die Anzahl der Eintr&auml;ge in der Datenbank insgesamt
und die Anzahl der noch nicht analysierten beziehungsweise nicht
gefundenen Dateien angezeigt.
<br>Links sehen Sie eine Liste mit allen Eintr&auml;gen in der
Datenbank. Wenn Sie einen ausw&auml;hlen, werden in der Mitte ein
Vorschaubild und die durchschnittliche Farbe angezeigt. Mit der "Diese
Datei aus der Datenbank entfernen"-Schaltfl&auml;che k&ouml;nnen Sie
diese gew&auml;hlte Datei aus der Datenbank l&ouml;schen
(Nat&uuml;rlich wird dabei die Datei auf dem Datentr&auml;ger nicht
gel&ouml;scht).
<br>In der oberen rechten Ecke sehen Sie eine Liste mit allen
Eintr&auml;gen, die nicht gefunden werden konnten oder die keine
g&uuml;ltigen Bilddateien sind. Mit der "Nicht gefundene Dateien
entfernen"-Schaltfl&auml;che k&ouml;nnen Sie diese Eintr&auml;ge aus
der Datenbank entfernen. Pr&uuml;fen Sie zuerst, ob es sich um Verweise
auf einen nicht eingelegten Wechseldatentr&auml;ger handelt!
<br>Darunter befindet sich eine Liste der noch nicht analysierten
Bilder. Das bedeutet, dass diese Eintr&auml;ge auch nicht verwendet
werden k&ouml;nnen, wenn Sie ein Mosaik auf Grundlage dieser Datenbank
erstellen. Dr&uuml;cken Sie die "Datenbank
aktualisieren"-Schaltfl&auml;che, um diese Dateien zu analysieren.
<br>Mit den "Verzeichnis zur Datenbank hinzuf&uuml;gen"- und "Datei
zur Datenbank hinzuf&uuml;gen"-Schaltfl&auml;chen k&ouml;nnen Sie
weitere Eintr&auml;ge hinzufgen.
<br>Die Ver&auml;nderungen in der Datenbank werden erst gespeichert,
wenn Sie die "Schlie&szlig;en"-Schaltfl&auml;che bet&auml;tigen und die
folgende Frage mit "Ja" best&auml;tigen.
<br>Sollten Sie beim Erstellen eines Mosaiks mit dieser Datenbank
Probleme haben, sollten Sie diese laden und die "Datenbank
aktualisieren"-Schaltfl&auml;che bet&auml;tigen. Damit werden nicht nur
die ausstehenden Datein anaylsiert, es wird auch nach Fehlern in der
Datenbank gesucht und versucht, diese zu korrigieren.
</p>
</body></html>